/*************************************************************************************/
/*  1. 프로그램ID : EU_p0606                                                         */
/*  2. 프로그램명 : 차트 조회(해외)                                                  */
/*  3. 서비스명   : EU_p0606                                                         */
/*  4. 사용테이블 :                                                                  */
/*  5. 작성자     : drfn                                                             */
/*  6. 입력항목   :                                                                  */
/*  7. 출력항목   :                                                                  */
/*************************************************************************************/
#ifndef __EU_TRAN_EU_p0606_H__
#define __EU_TRAN_EU_p0606_H__

/*************************************************************************************/
/* include file                                                                      */
/*************************************************************************************/

/*************************************************************************************/
/* define constant                                                                   */
/*************************************************************************************/
//#define EU_TRAN                       "EU_p0606"
//#define LLONG                         long long


/*************************************************************************************/
/* Input structure                                                                   */
/*************************************************************************************/

/* InRec1:                                                                           */
typedef struct
{
	char	Shcode[10];							/* 종목코드							*/
	char	date[8];							/* 검색시작일						*/
	char	num[4];								/* 조회건수							*/
	char	unit[3];							/* 구분(Tick/Sec/Min/Day)			*/
	char	button[1];							/* 조회모드(틱:0/분:1/일:2/주:3/월:4)*/
	char	nflag[1];							/* 조회구분(다음:1/조회:0)			*/
	char	nkey[14];							/* 페치키							*/
	char	nowData[1];							/* 당일조회							*/
} EU_p0606_InRec1;


/*************************************************************************************/
/* Output structure                                                                  */
/*************************************************************************************/

/* OutRec1:                                                                          */
// 사용하지 않는 Field 주석처리
typedef struct
{
    char    name[40];                             /* 종목명(40)                      */
    char    price[10];                            /* 현재가(10)                      */
    char    sign[1];                              /* 등락부호(1)                     */
    char    change[10];                           /* 대비(10)                        */
    char    chrate[6];                            /* 대비율(6)                       */
//    char    volume[10];                           /* 거래량(10)                      */
//    char    offer[10];                            /* 매도호가(10)                    */
//    char    bid[10];                              /* 매수호가(10)                    */
    char    preprice[10];                         /* 기준가(10)                      */
    char    nkey[14];                             /* 이전키(14)                      */
//    char    cntsz[6];                             /* 차트사이즈(6)                   */
    char    fcnt[5];                              /* 차트카운트(5)                   */
    char    bojomsg[400];                         /* 보조메시지(400)                 */
} EU_p0606_OutRec1;

typedef struct
{
    char    name[40];                             /* 종목명(40)                      */
    char    price[10];                            /* 현재가(10)                      */
    char    sign[1];                              /* 등락부호(1)                     */
    char    change[10];                           /* 대비(10)                        */
    char    chrate[6];                            /* 대비율(6)                       */
    char    volume[10];                           /* 거래량(10)                      */
//    char    offer[10];                            /* 매도호가(10)                    */
//    char    bid[10];                              /* 매수호가(10)                    */
    char    preprice[10];                         /* 기준가(10)                      */
    char    nkey[14];                             /* 이전키(14)                      */
//    char    cntsz[6];                             /* 차트사이즈(6)                   */
    char    fcnt[5];                              /* 차트카운트(5)                   */
    char    bojomsg[400];                         /* 보조메시지(400)                 */
} EU_p0606_OutRec1_EX;

/* OutRec2:                                                                          */
// 사용하지 않는 Field 주석처리
//char EU_p0606_OutRec2_count[4];
typedef struct
{
    char    date[8];                              /* 날짜(8)                         */
    char    open[10];                             /* 시가(10)                        */
    char    high[10];                             /* 고가(10)                        */
    char    low[10];                              /* 저가(10)                        */
    char    close[10];                            /* 종가(10)                        */
    char    volume[10];                           /* 거래량(10)                      */
} EU_p0606_OutRec2;

/* Chart Data:																		 */
typedef struct _EU_p0606_CHART
{
	char    fcnt[5];         					  /* 차트카운트(5)                   */
	char    bojomsg[400];						  /* 보조메시지(400)                 */
	//EU_p0606_OutRec2  chart[50000];
	EU_p0606_OutRec2  chart[1];						// 동적크기임.
} EU_p0606_CHART;

/*************************************************************************************/

#endif

