/*************************************************************************************/
/*  1. 프로그램ID : KB_p0515                                                         */
/*  2. 프로그램명 : 차트 조회(FO 지표)                                               */
/*  3. 서비스명   : KB_p0515                                                         */
/*  4. 사용테이블 :                                                                  */
/*  5. 작성자     : drfn                                                             */
/*  6. 입력항목   :                                                                  */
/*  7. 출력항목   :                                                                  */
/*************************************************************************************/
#ifndef __KB_TRAN_KB_p0515_H__
#define __KB_TRAN_KB_p0515_H__

/*************************************************************************************/
/* include file                                                                      */
/*************************************************************************************/

/*************************************************************************************/
/* define constant                                                                   */
/*************************************************************************************/
//#define KB_TRAN                       "KB_p0515"
//#define LLONG                         long long


/*************************************************************************************/
/* Input structure                                                                   */
/*************************************************************************************/

#ifndef ChartKeySize
#define		ChartKeySize		84
#endif

/* InRec1:                                                                           */
typedef struct
{
    char    code[15];                            /* 종목코드(15)                    */
    char    date[8];                             /* 검색시작일(8)                   */
    char    maxbong[4];                          /* 검색할데이터갯수(4)             */
    char    unit[3];                             /* N봉(틱분시일)(3)                */
    char    btngb[1];                            /* 구분(틱분일주월)(1)             */
    char    nextgb[1];                           /* 조회구분(다음조회)(1)           */
	char    nextkey[ChartKeySize];			     /* 검색키(21)                      */
    char    imgrgb[1];                           /* 봉구분(허수실봉)(1)             */
}KB_p0515_InRec;


/*************************************************************************************/
/* Output structure                                                                  */
/*************************************************************************************/

typedef struct
{
    char    name[20];                             /* 종목명(20)                      */
    char    price[10];                            /* 현재가(10)                      */
    char    sign[1];                              /* 등락부호(1)                     */
    char    change[10];                           /* 대비(10)                        */
    char    chrate[6];                            /* 대비율(6)                       */
    char    volume[10];                           /* 거래량(10)                      */
    char    preprice[10];                         /* 기준가(10)                      */
	char    nkey[ChartKeySize];
    char    fcnt[5];                              /* 차트카운트(5)                   */
    char    bojomsg[400];                         /* 보조메시지(256)                 */
} KB_p0515_OutRec;

typedef struct
{
    char    date[8];                              /* 날짜(8)                         */
    char    open[10];                             /* 시가(10)                        */
    char    high[10];                             /* 고가(10)                        */
    char    low[10];                              /* 저가(10)                        */
    char    close[10];                            /* 종가(10)                        */
    char    volume[10];                           /* 거래량(10)                      */

	//[A00000408]거래대금 12 -> 18.
    //char    value[12];                            /* 거래대금(12)                    */
	//char    value[18];                            /* 거래대금(18)                    */

    char    rights[1];                            /* 권리락(1)                       */
} KB_p0515_OutRecArr;

typedef struct _KB_p0515_CHART
{
	char				fcnt[5];					/* 차트카운트(5)                   */
	char				bojomsg[400];				/* 보조메시지(300)                 */
	KB_p0515_OutRecArr	chart[1];					// 동적크기임.
} KB_p0515_CHART;

/*************************************************************************************/

#endif

