#ifndef __MARKETINDICATOR__BYGM0604
#define __MARKETINDICATOR__BYGM0604

const TCHAR *	g_lpszInputMarketIndicator[] = 
{ 
		_T("뉴스강도"),//0
		_T("뉴스건수"),//1
		_T("신용잔고"),//2
		_T("금리"),//3
		_T("예탁금"),//4
		_T("외국인 보유율"),//5
		_T("외국인 보유수량"),//6
		_T("투자자 순매수(KOSPI)"),//7
		_T("투자자 순매수(KOSDAQ)"),//8
		_T("투자자 순매수(선물)"),//9
		_T("투자자 순매수(콜옵션)"),//10
		_T("투자자 순매수(풋옵션)"),//11
		_T("외국인소진율"),//12
		_T("시가총액 구분"),//13
		_T("등락주선 구분"),//14
		_T("등락주비율 구분"),//15		
		_T("NFI"),//16
		NULL };

const TCHAR *	g_lpszOutputMarketIndicator[] = 
{ 
		_T("뉴스강도"),//1 
		_T("뉴스건수"),//2 
		_T("신용잔고"),//3 
		_T("국고채3년금리"),//4 
		_T("회사채3년금리"),//5 
		_T("CD(91일)금리"),//6 
		_T("예탁금"),//7 
		_T(""),//8 
		_T(""),//9 
		_T("외국인 보유율"),//10
		_T("외국인 보유수량"),//11
		_T("개인 투자자 순매수(KOSPI)"),//12
		_T("기관 투자자 순매수(KOSPI)"),//13
		_T("외국인 투자자 순매수(KOSPI)"),//14
		_T("개인 투자자 순매수(KOSDAQ)"),//15
		_T("기관 투자자 순매수(KOSDAQ)"),//16
		_T("외국인 투자자 순매수(KOSDAQ)"),//17
		_T("개인 투자자 순매수(선물)"),//18
		_T("기관 투자자 순매수(선물)"),//19
		_T("외국인 투자자 순매수(선물)"),//20
		_T("개인 투자자 순매수(콜옵션)"),//21
		_T("기관 투자자 순매수(콜옵션)"),//22
		_T("외국인 투자자 순매수(콜옵션)"),//23
		_T("개인 투자자 순매수(풋옵션)"),//24
		_T("기관 투자자 순매수(풋옵션)"),//25
		_T("외국인 투자자 순매수(풋옵션)"),//26
		_T("외국인소진율"),//27
		_T("시가총액 구분"),//28
		_T("등락주선 구분"),//29
		_T("등락주비율 구분"),//30
		_T("NFI"),//31
		NULL 
};

#endif //__MARKETINDICATOR__BYGM0604
