/*************************************************************************************/
/*  1. 프로그램ID : EU_a7001                                                         */
/*  2. 프로그램명 : 잔고조회                                                         */
/*  3. 서비스명   : EU_a7001                                                         */
/*  4. 사용테이블 :                                                                  */
/*  5. 작성자     : drfn                                                             */
/*  6. 입력항목   :                                                                  */
/*  7. 출력항목   :                                                                  */
/*************************************************************************************/
#ifndef __EU_TRAN_EU_a7001_H__
#define __EU_TRAN_EU_a7001_H__

/*************************************************************************************/
/* include file                                                                      */
/*************************************************************************************/

/*************************************************************************************/
/* define constant                                                                   */
/*************************************************************************************/
//#define EU_TRAN                       "EU_a7001"
//#define LLONG                         long long


/*************************************************************************************/
/* Input structure                                                                   */
/*************************************************************************************/

/* InRec1:                                                                           */
typedef struct
{
    char    accno[11];                            /* 계좌번호(11)                    */
}EU_a7001_InRec1;


/*************************************************************************************/
/* Output structure                                                                  */
/*************************************************************************************/

/* OutRec1:                                                                          */
typedef struct
{
    char    nCnt[4];                              /* 주문체결구분(4)                 */
}EU_a7001_OutRec1;

/* OutRec2:                                                                          */
// EU_a7001_OutRec2의 배열 정보 = 'EU_a7001_OutRec1+nCnt'
typedef struct
{
    char    accno[11];                            /* 계좌번호(11)                    */
    char    jmcode[12];                           /* 종목코드(12)                    */
    char    sygb[2];                              /* 신용구분(2)                     */
    char    sdate[8];                             /* 대출일(8)                       */
    char    jmname[20];                           /* 종목명(20)                      */
    char    estsonik[16];                         /* 평가손익(16)                    */
    char    rate[8];                              /* 수익률(8)                       */
    char    bqty[9];                              /* 보유수량(9)                     */
    char    buyamt[9];                            /* 매입단가(9)                     */
    char    pre_price[9];                         /* 전일종가(9)                     */
    char    bep_price[9];                         /* BEP단가(9)                      */
    char    janqty[9];                            /* 결제잔고(9)                     */
    char    price[9];                             /* 현재가(9)                       */
    char    sign[1];                              /* 전일구분(1)                     */
    char    psmevol[9];                           /* 전일순매수량(9)                 */
    char    tsmevol[9];                           /* 당일 순매수량(9)                */
    char    menusum[16];                          /* 매입금액(16)                    */
    char    estamt[16];                           /* 평가금액(16)                    */
    char    fee[16];                              /* 수수료(16)                      */
    char    tax[16];                              /* 세금(16)                        */
    char    tmedosonik[16];                       /* 당일 총 매도손익(16)            */
    char    medosu[1];                            /* 매도/매수 구분(1)               */
    char    medoga[9];                            /* (최우선)매도호가(9)             */
    char    mesuga[9];                            /* (최우선)매수호가(9)             */
    char    ordgaqty[9];                          /* 주문가능 수량(9)                */
    char    giga[9];                              /* 기준가(9)                       */
    char    sonrate[9];                           /* 손익률(9)                       */
    char    sinamt[16];                           /* 신용금액(16)                    */
    char    sininter[16];                         /* 신용이자(16)                    */
    char    lastday[8];                           /* 만기일(8)                       */
    char    trsonik[16];                          /* 당일실현손익(유가)(16)          */
    char    ratesonik[16];                        /* 당일실현손익률(유가)(16)        */
    char    strsonik[16];                         /* 당일실현손익(신용)(16)          */
    char    sratesonik[16];                       /* 당일실현손익률(신용)(16)        */
    char    pjogasonik[16];                       /* 전일종가 기준 평가손익(16)      */
    char    pjogarate[16];                        /* 전일종가 기준 수익률(16)        */
    char    holdrate[6];                          /* 보유비중(6)                     */
    char    pjogaest[16];                         /* 전일종가 전일평가(16)           */
    char    sygbtxt[10];                          /* 신용구분(TEXT)(10)              */
    char    dnlmtprice[9];                        /* 하한가(9)                       */
    char    uplmtprice[9];                        /* 상한가(9)                       */
    char    berate[16];                           /* 손익분기(16)                    */
    char    damboloanamt[9];                      /* 담보대출수량(9)                 */
    char    sygb2[2];                             /* 신용구분2(2)                    */
    char    change[8];                            /* 전일대비(8)                     */
    char    diff[6];                              /* 등락률(6)                       */
    char    volume[12];                           /* 거래량(12)                      */
}EU_a7001_OutRec2;

/*************************************************************************************/

#endif

