/*******************************************************************************
 *  Components  : symbtab.c     
 *  Description : DEFINITION FOR REAL TIME 시세 SYMBOL                  
 *  Rev. History: Ver   Date    Description                  
 *                ----  ------- ------------------------------------------------
 *                1.0   2004.06 Initial version 
 ******************************************************************************/
#include <axis.h>
#include "realtick.h"

/* tickjong : 주식 Key define   */
struct  symrts  sr_stock[] = {
    /* 종목시세 */
    { 'A', {{ 0, "타입"  }, { 23, "현재가"   }, { 24, "전일대비" }, { 33, "등락율"   }, 
        { 25, "매도호가" }, { 26, "매수호가" }, { 27, "거래량"   },  
        { 28, "거래대금" }, { 29, "시가"     }, { 30, "고가"     },  
        { 31, "저가"     }, { 701, "VI"		 }, { 702, "VI시간"  }, { 703, "VI타입"	 },
        {  0, ""         },}},

    /* 종목체결 */
    { 'B', {{ 0, "타입"  }, { 34, "체결시간" }, 	{ 23, "현재가"   }, { 24, "전일대비" },
        { 33, "등락율"   }, { 25, "매도호가" },     { 26, "매수호가" },
        { 32, "체결량"   }, { 27, "거래량"   },     { 28, "거래대금" },
        { 29, "시가"     }, { 30, "고가"     },     { 31, "저가"     },
        { 19, "매수체결량"},{ 20, "매도체결량"},    { 118, "매도체결합"},
        { 119,"매수체결합"},{ 441,"우선매도잔량"},  { 461, "우선매수잔량"  },
        { 39, "평균가"    },{207, "신고가" },       { 36,  "체결강도" },
        {241, "정적VI상승가"}, {258, "정적VI하락가"},{199, "KO접근도" },   
        {  0, ""         },}},

    /* 우선호가 */
    { 'C', {{ 0, "타입"  }, { 25, "매도호가" }, { 26, "매수호가" },  {  0, ""         },}},
    /* 호가잔량 */
    { 'D', {{ 0, "타입"  }, { 40, "호가시간" },
        { 51, "매도가1"  }, { 52, "매도가2"  },  { 53, "매도가3"  },
        { 54, "매도가4"  }, { 55, "매도가5"  },  
        { 56, "매도가6"  }, { 57, "매도가7"  },  { 58, "매도가8"  },
        { 59, "매도가9"  }, { 60, "매도가10" },  
        { 41, "매도량1"  }, { 42, "매도량2"  },  { 43, "매도량3"  },
        { 44, "매도량4"  }, { 45, "매도량5"  },  
        { 46, "매도량6"  }, { 47, "매도량7"  },  { 48, "매도량8"  },
        { 49, "매도량9"  }, { 50, "매도량10" },  
        { 81, "매도비1"  }, { 82, "매도비2"  },  { 83, "매도비3"  },
        { 84, "매도비4"  }, { 85, "매도비5"  },  
        { 86, "매도비6"  }, { 87, "매도비7"  },  { 88, "매도비8"  },
        { 89, "매도비9"  }, { 90, "매도비10" },  
        { 71, "매수가1"  }, { 72, "매수가2"  },  { 73, "매수가3"  },
        { 74, "매수가4"  }, { 75, "매수가5"  },  
        { 76, "매수가6"  }, { 77, "매수가7"  },  { 78, "매수가8"  },
        { 79, "매수가9"  }, { 80, "매수가10" },  
        { 61, "매수량1"  }, { 62, "매수량2"  },  { 63, "매수량3"  },
        { 64, "매수량4"  }, { 65, "매수량5"  },  
        { 66, "매수량6"  }, { 67, "매수량7"  },  { 68, "매수량8"  },
        { 69, "매수량9"  }, { 70, "매수량10" },  
        { 91, "매수비1"  }, { 92, "매수비2"  },  { 93, "매수비3"  },
        { 94, "매수비4"  }, { 95, "매수비5"  },  
        { 96, "매수비6"  }, { 97, "매수비7"  },  { 98, "매수비8"  },
        { 99, "매수비9"  }, {100, "매수비10" },  
        {101, "매도총량" }, {104, "매도총비" },
        {106, "매수총량" }, {109, "매수총비" },
        {111, "예상가격" }, {112, "예상수량" },
        {113, "예상대비" }, {114, "예상등락" },
        {115, "예상대전" }, {116, "예상등전" },
        {  0, ""         },}},

    /* 시간외호가 */
    { 'E', {{ 0, "타입"  }, { 40, "호가시간" },
        {102, "매도총량" }, {105, "매도총비" },
        {107, "매수총량" }, {110, "매수총비" },
        {  0, ""         },}},

    /* 거래원 */
    { 'F', {{ 0, "타입"  }, {121, "매도원1"  }, {122, "매도원2"  }, {123, "매도원3"  },
            {124, "매도원4"  }, {125, "매도원5"  },
            {126, "매도코1"  }, {127, "매도코2"  }, {128, "매도코3"  },
            {129, "매도코4"  }, {130, "매도코5"  },
            {131, "매도량1"  }, {132, "매도량2"  }, {133, "매도량3"  },
            {134, "매도량4"  }, {135, "매도량5"  },
            {136, "매도비1"  }, {137, "매도비2"  }, {138, "매도비3"  },
            {139, "매도비4"  }, {140, "매도비5"  },
            {141, "매도중1"  }, {142, "매도중2"  }, {143, "매도중3"  },
            {144, "매도중4"  }, {145, "매도중5"  },
            {151, "매수원1"  }, {152, "매수원2"  }, {153, "매수원3"  },
            {154, "매수원4"  }, {155, "매수원5"  },
            {156, "매수코1"  }, {157, "매수코2"  }, {158, "매수코3"  },
            {159, "매수코4"  }, {160, "매수코5"  },
            {161, "매수량1"  }, {162, "매수량2"  }, {163, "매수량3"  },
            {164, "매수량4"  }, {165, "매수량5"  },
            {166, "매수비1"  }, {167, "매수비2"  }, {168, "매수비3"  },
            {169, "매수비4"  }, {170, "매수비5"  },
            {171, "매수중1"  }, {172, "매수중2"  }, {173, "매수중3"  },
            {174, "매수중4"  }, {175, "매수중5"  },
            {176, "외국계D"  }, {177, "외국계S"  }, {178, "외국계H"  },
            {179, "외매도비" }, {180, "외매수비" }, 
            {192, "체결시간" }, }},
    
    /* ETF NAV */
    /*{ 'G', {{ 0, "타입"  }, {734, "NAV시간" },
        {723, "NAV시세" }, {724, "NAV대비" },
        {  0, ""         },}},*/
    { 'G', {{ 0, "타입"  }, {836, "NAV시간" },
        {837, "NAV시세" }, {838, "NAV대비" },
        {  0, ""         },}},


    /* 종목 장운영 정보(Randem End Setting) */
    { 'H', {{ 0, "타입"  }, {190, "종목장운영정보" }, {191, "장운영번호" },
        {  0, ""         },}},

    /* 2005.05.30 */
    /* 시간외단일가매매 시세 */
    { 'a', {{ 0, "타입"  }, {723, "현재가"   }, {724, "전일대비" }, {733, "등락율"   },
        {725, "매도호가" }, {726, "매수호가" }, {727, "거래량"   },
        {728, "거래대금" }, {729, "시가"     }, {730, "고가"     },
        {731, "저가"     }, {920, "상한가"   }, {303, "하한가"   },
        {  0, ""         },}},

    /* 시간외단일가매매 체결 */
    { 'b', {{ 0, "타입"  }, {734, "체결시간" }, {723, "현재가"   }, {724, "전일대비" },
        {733, "등락율"   }, {725, "매도호가" }, {726, "매수호가" },
        {732, "체결량"   }, {727, "거래량"   }, {728, "거래대금" },
        {729, "시가"     }, {730, "고가"     }, {731, "저가"     },
        {737, "매도잔량" }, {738, "매수잔량" }, {  0, ""         },}},

    /* 시간외단일가매매 우선호가 */
    { 'c', {{ 0, "타입"  }, {725, "매도호가" }, {726, "매수호가" },  {  0, ""         },}},

    /* 시간외단일가매매 호가잔량 */
    { 'd', {{ 0, "타입"  }, {740, "호가시간" },
        {751, "매도가1"  }, {752, "매도가2"  },  {753, "매도가3"  },
        {754, "매도가4"  }, {755, "매도가5"  },  
        {741, "매도량1"  }, {742, "매도량2"  },  {743, "매도량3"  },
        {744, "매도량4"  }, {745, "매도량5"  },  
        {781, "매도비1"  }, {782, "매도비2"  },  {783, "매도비3"  },
        {784, "매도비4"  }, {785, "매도비5"  },  
            {771, "매수가1"  }, {772, "매수가2"  },  {773, "매수가3"  },
        {774, "매수가4"  }, {775, "매수가5"  },  
        {761, "매수량1"  }, {762, "매수량2"  },  {763, "매수량3"  },
        {764, "매수량4"  }, {765, "매수량5"  },  
        {791, "매수비1"  }, {792, "매수비2"  },  {793, "매수비3"  },
        {794, "매수비4"  }, {795, "매수비5"  },  
        {801, "매도총량" }, {804, "매도총비" },
        {806, "매수총량" }, {809, "매도총비" },
        {811, "예상가격" }, {812, "예상수량" },
        {813, "예상대비" }, {814, "예상등락" },
        {  0, ""         },}},

    /* 시간외단일가매매 장운영 정보(Randem End Setting) */
    { 'h', {{ 0, "타입"  }, {890, "랜덤앤드" },
        {  0, ""         },}},

    /* ELW 투자지표 */
    { 'i', {{ 0, "타입"  }, {895, "시간"   }, {896, "패리티"     }, {897, "기어링비율" },
        {898, "손익분기율" }, {899, "자본지지점" }, {891, "현재가"     },
        {892, "대비"       }, {893, "등락율"     }, {894, "거래량"     },
        {881, "역사변동성" }, {882, "내재변동성" }, {883, "이론가"     },
        {884, "델타"       }, {885, "감마"       }, {886, "세타"       },
        {887, "베가"       }, {888, "로"         }, {889, "괴리율"     },
        {900, "e*기어링"   }, {909, "틱환산"     },
        {  0, ""            },}},

    /* ELW 호가잔량 */
    { 'y', {{ 0, "타입"  }, { 40, "호가시간" },
        { 51, "매도가1"  }, { 52, "매도가2"  },  { 53, "매도가3"  },
        { 54, "매도가4"  }, { 55, "매도가5"  },  
        { 56, "매도가6"  }, { 57, "매도가7"  },  { 58, "매도가8"  },
        { 59, "매도가9"  }, { 60, "매도가10" },  
        { 41, "매도량1"  }, { 42, "매도량2"  },  { 43, "매도량3"  },
        { 44, "매도량4"  }, { 45, "매도량5"  },  
        { 46, "매도량6"  }, { 47, "매도량7"  },  { 48, "매도량8"  },
        { 49, "매도량9"  }, { 50, "매도량10" },  
        { 81, "매도비1"  }, { 82, "매도비2"  },  { 83, "매도비3"  },
        { 84, "매도비4"  }, { 85, "매도비5"  },  
        { 86, "매도비6"  }, { 87, "매도비7"  },  { 88, "매도비8"  },
        { 89, "매도비9"  }, { 90, "매도비10" },  
        { 71, "매수가1"  }, { 72, "매수가2"  },  { 73, "매수가3"  },
        { 74, "매수가4"  }, { 75, "매수가5"  },  
        { 76, "매수가6"  }, { 77, "매수가7"  },  { 78, "매수가8"  },
        { 79, "매수가9"  }, { 80, "매수가10" },  
        { 61, "매수량1"  }, { 62, "매수량2"  },  { 63, "매수량3"  },
        { 64, "매수량4"  }, { 65, "매수량5"  },  
        { 66, "매수량6"  }, { 67, "매수량7"  },  { 68, "매수량8"  },
        { 69, "매수량9"  }, { 70, "매수량10" },  
        { 91, "매수비1"  }, { 92, "매수비2"  },  { 93, "매수비3"  },
        { 94, "매수비4"  }, { 95, "매수비5"  },  
        { 96, "매수비6"  }, { 97, "매수비7"  },  { 98, "매수비8"  },
        { 99, "매수비9"  }, {100, "매수비10" },  
        {101, "매도총량" }, {104, "매도총비" },
        {106, "매수총량" }, {109, "매수총비" },
        {861, "LP매도1"  }, {862, "LP매도2"  },  {863, "LP매도3"  },
        {864, "LP매도4"  }, {865, "LP매도5"  },  
        {866, "LP매도6"  }, {867, "LP매도7"  },  {868, "LP매도8"  },
        {869, "LP매도9"  }, {870, "LP매도10" },  
        {871, "LP매수1"  }, {872, "LP매수2"  },  {873, "LP매수3"  },
        {874, "LP매수4"  }, {875, "LP매수5"  },  
        {876, "LP매수6"  }, {877, "LP매수7"  },  {878, "LP매수8"  },
        {879, "LP매수9"  }, {880, "LP매수10" },  
        {850, "LP매도총비" }, {851, "LP매수총비" },
        {111, "예상가격" }, {112, "예상수량" },
        {113, "예상대비" }, {114, "예상등락" },
        {115, "예상대전" }, {116, "예상등전" },
        {  0, ""         },}},

    /* 종목별 프로그램 매매 */
    { 'R', {{ 0, "타입"  }, {634, "매매시간" }, 
        {635, "매도체결수량" }, {636, "매도잔량" }, {637, "매도수량" }, 
        {638, "매수체결수량" }, {639, "매수잔량" }, {640, "매수수량" }, 
		{641, "순매수체결수량" }, {623, "현재가"},
        {  0, ""            },}},

    /* ETF 예상NAV 16 */
    { 'I', {{ 0, "타입"  }, {834, "NAV시간" },
        {823, "NAV시세" }, {824, "NAV대비" },
        {  0, ""         },}},
    
    /* LP 호가 내재변동성   17 */                           
    { 'k', {{ 0, "타입"  }, {919, "LP호가내재변동성" },
        {  0, ""         },}},
    
    /* 분배정보, 임의종료 18  */
    { 'q', {{ 0, "타입"  }, {950, "분배정보" },{951, "임의종료" },
        {  0, ""         },}},
            
    {  0,  {{  0, ""         },}}
    
    
};

/* tickjisu : 업종지수 Key define   */
struct  symrts sr_jisu[] = { 
    /* 업종지수 */
    { 'J', {{ 0, "타입"  }, {  34,  "시간"     }, { 23, "지수"     }, { 24, "전일대비"  },
            {  33,  "등락율"   }, { 32, "체결량"   }, { 27, "거래량"    },
            {  28,  "거래대금" }, {207, "신고가"   }, {600, "예상/정규장구분"},
            { 29, "시가지수"}, { 30, "고가지수"}, { 31, "저가지수"}, 
            { 501,  "거래증가율"}, {502, "상승비율"}, {503, "업종PER"},
            { 326,  "역사적변동" }, { 361,  "업종회전율" }, 
            {  0, ""         },}},
    /* 업종등락 */
    { 'U', {{ 0, "타입"  }, {  34, "시간"      }, {252, "상승종목" }, {251, "상한종목" },
            { 253, "보합종목"  }, {255, "하락종목" }, {254, "하한종목" },
        { 256, "거래종목수"},{  0, ""         },}},
    /* 예상지수 */
    { 'X', {{ 0, "타입"  }, {  34,  "시간"     }, { 23, "지수"     }, { 24, "전일대비"  },
            {  33,  "등락율"   }, { 32, "체결량"   }, { 27, "거래량"    },
            {  28,  "거래대금" }, {600, "예상/정규장구분"},
            {  0, ""         },}},
    /* 예상등락 */
    { 'Y', {{ 0, "타입"  }, {  34, "시간"      }, {252, "상승종목" }, {251, "상한종목" },
            { 253, "보합종목"  }, {255, "하락종목" }, {254, "하한종목" },
            {  27, "거래량"    }, { 28, "거래대금" }, {  0, ""         },}},
    /* KOSPI200 변동종목 */
    { 'u', {{ 0, "타입"  }, {  34, "시간"      }, {252, "상승10"  }, {251, "하락10"  },
                {  0, ""         },}},

    /* 실시간 지수      */
    { 'l', {{ 0, "타입"  }, {  34, "시간"      }, {23, "실시간지수"  },
                {  0, ""         },}},

    /* END-OF-TABLE */
    {  0,  {{   0, ""      },}}
};

/* tickfopt : 선물, 옵션 Key Define ----------------------------------------- */
struct  symrts  sr_future[] = {
    /* 선물체결 */
    { 'K', 
        {{ 0, "타입"  }, { 34, "체결시간" }, { 23, "현재가"   }, { 24, "전일대비" },
        { 33, "등락율"   }, { 25, "매도호가" }, { 26, "매수호가" },
        { 32, "체결량"   }, { 27, "거래량"   }, { 28, "거래대금" },
        { 29, "시가"     }, { 30, "고가"     }, { 31, "저가"     },
        {201, "미결약정" }, {202, "이론가"   }, {203, "이론BASIS"},
        {204, "시장BASIS"}, {205, "괴리율"   }, {206, "미결대비" },
        {  2, "K200지수" }, { 19, "매수체결량"},{ 20, "매도체결량"},
        {207, "직전대비신호"   }, {271, "실시간상한가"}, {272, "실시간하한가"},
        {  0, ""         },}},


    /* 호가잔량 */
    { 'L', {{ 0, "타입"  }, { 40, "호가시간" },
        { 25, "매도호가" }, { 26, "매수호가" },
        { 51, "매도가1"  }, { 52, "매도가2"  },  { 53, "매도가3"  },
        { 54, "매도가4"  }, { 55, "매도가5"  },  
        { 41, "매도량1"  }, { 42, "매도량2"  },  { 43, "매도량3"  },
        { 44, "매도량4"  }, { 45, "매도량5"  },  
        {211, "매도건1"  }, {212, "매도건2"  },  {213, "매도건3"  },
        {214, "매도건4"  }, {215, "매도건5"  },  
        { 71, "매수가1"  }, { 72, "매수가2"  },  { 73, "매수가3"  },
        { 74, "매수가4"  }, { 75, "매수가5"  },  
        { 61, "매수량1"  }, { 62, "매수량2"  },  { 63, "매수량3"  },
        { 64, "매수량4"  }, { 65, "매수량5"  },  
        {221, "매수건1"  }, {222, "매수건2"  },  {223, "매수건3"  },
        {224, "매수건4"  }, {225, "매수건5"  },  
        {101, "매도총량" }, {103, "매도총건" },
        {106, "매수총량" }, {108, "매수총건" }, {120, "매도수량차"},
		{90, "장운용종료"},
		{115, "예상전일대비" }, {116, "예상등락율" },
		{111, "예상가격" }, /*  <= 예상가는 가장 마지막에 위치  */
        {  0, ""         },}},

    /* 장운영	*/
    { 'e', {{ 0, "타입"  }, { 271, "실시간상한가" }, {272, "실시간하한가"},
        {  0, ""         },}},
        
	/* 예상가 */
	{ '4', 
		{{ 0, "타입"  }, {90, "장운용종료"}, 
		{115, "예상전일대비" }, {116, "예상등락율" }, {111, "예상가격" },
		{  0, ""         },}},

	/*	20150625	*/
	/* 상하한가 제한폭 확대	*/
	{ '5', 
		{{ 0, "타입"  }, {381, "현재상한단계"}, 
		{382, "현재하한단계" }, {354, "현재상한가" }, {355, "현재하한가" },
		{  0, ""         },}},
	/* 상하한가 제한폭 예정	*/
	{ '6', 
		{{ 0, "타입"  }, {273, "예정단계"}, {274, "예정방향" }, {275, "예정시각" },
		{  0, ""         },}},
    {  0,  {{  0, ""         },}}

};

struct  symrts  sr_option[] = {
    /* 옵션체결 WHERE_OJ, WHAT_JS   */
    { 'O', {{ 0, "타입"  }, { 34, "체결시간" }, { 23, "현재가"   }, { 24, "전일대비" },
        { 33, "등락율"   }, { 25, "매도호가" }, { 26, "매수호가" },
        { 32, "체결량"   }, { 27, "거래량"   }, { 28, "거래대금" },
        { 29, "시가"     }, { 30, "고가"     }, { 31, "저가"     },
        {201, "미결약정" }, {202, "이론가"   }, {206, "미결증감" }, 
        {243, "델타"     }, {244, "감마"     }, {245, "세타"     }, 
        {246, "베가"     }, {247, "로"       }, {248, "내재변동" }, 
        {250, "K200지수"}, {261, "내재가치" }, {240, "시간가치" }, 
        { 19, "매수체결량"},{ 20, "매도체결량"},{207, "직전대비신호" },
        {205, "괴리치"   }, {323, "괴리율"},    {249, "선물가"   },
		{271, "실시간상한가"}, {272, "실시간하한가"},
        {0, ""         },}},

    /* 호가잔량 WHERE_OJ, WHAT_HS   */
    { 'P', {{ 0, "타입"  }, { 40, "호가시간" },
        { 25, "매도호가" }, { 26, "매수호가" },
        { 51, "매도가1"  }, { 52, "매도가2"  },  { 53, "매도가3"  },
        { 54, "매도가4"  }, { 55, "매도가5"  },  
        { 41, "매도량1"  }, { 42, "매도량2"  },  { 43, "매도량3"  },
        { 44, "매도량4"  }, { 45, "매도량5"  },  
        {211, "매도건1"  }, {212, "매도건2"  },  {213, "매도건3"  },
        {214, "매도건4"  }, {215, "매도건5"  },  
        { 71, "매수가1"  }, { 72, "매수가2"  },  { 73, "매수가3"  },
        { 74, "매수가4"  }, { 75, "매수가5"  },  
        { 61, "매수량1"  }, { 62, "매수량2"  },  { 63, "매수량3"  },
        { 64, "매수량4"  }, { 65, "매수량5"  },  
        {221, "매수건1"  }, {222, "매수건2"  },  {223, "매수건3"  },
        {224, "매수건4"  }, {225, "매수건5"  },  
        {101, "매도총량" }, {103, "매도총비" },
        {106, "매수총량" }, {108, "매수총비" }, {120, "매도수량차"},
		{90, "장운용종료"},
        {115, "예상전일대비" }, {116, "예상등락율" },
		{111, "예상가격" }, /*  <= 예상가는 가장 마지막에 위치  */
        {  0, ""         },}},

    /* 투자자별 순매수 WHERE_OJ, WHAT_TS */
    { 's', {{ 0, "타입"  }, { 260,"종목코드"},
        { 261, "투자자구분" }, { 262,"투자자계약수"}, { 263,"투자자계약금"},
        {  0, ""         },}},
            
    /* 예상 WHAT_PJ*/    
    { '1', {{ 0, "타입"  }, {111, "예상가격" }, {115, "예상전일대비" }, {116, "예상등락률" },
            {  0, ""         },}},
     
    /* 장운영	*/
    { '2', {{ 0, "타입"  }, { 271, "실시간상한가" }, {272, "실시간하한가"},
        {  0, ""         },}},

	/*	20150625	*/
	/* 상하한가 제한폭 확대	*/
	{ '7', 
		{{ 0, "타입"  }, {381, "현재상한단계"}, 
		{382, "현재하한단계" }, {354, "현재상한가" }, {355, "현재하한가" },
		{  0, ""         },}},
	/* 상하한가 제한폭 예정	*/
	{ '8', 
		{{ 0, "타입"  }, {273, "예정단계"}, {274, "예정방향" }, {275, "예정시각" },
		{  0, ""         },}},

    {  0,  {{  0, ""         },}}
};

/* tickpusi : StockOptions  */
struct  symrts  sr_stocko[] = {
    /* SO옵션체결 */
    { 'o', {{ 0, "타입"  }, { 34, "체결시간" }, { 23, "현재가"   }, { 24, "전일대비" },
        { 33, "등락율"   }, { 25, "매도호가" }, { 26, "매수호가" },
        { 32, "체결량"   }, { 27, "거래량"   }, { 28, "거래대금" },
        { 29, "시가"     }, { 30, "고가"     }, { 31, "저가"     },
        {201, "미결약정" }, {202, "이론가"   }, {243, "델타    " }, 
        {244, "감마    " }, {245, "세타    " }, {246, "베가    " }, 
        {247, "로오"     }, {250, "매도체결" }, {251, "매수체결" }, 
        {206, "미결제증감"}, 
        {  0, ""         },}},
    /* SO호가잔량 */
    { 'p', {{ 0, "타입"  }, { 40, "호가시간" },
        { 25, "매도호가" }, { 26, "매수호가" },
        { 51, "매도가1"  }, { 52, "매도가2"  },  { 53, "매도가3"  },
        { 54, "매도가4"  }, { 55, "매도가5"  },  
        { 41, "매도량1"  }, { 42, "매도량2"  },  { 43, "매도량3"  },
        { 44, "매도량4"  }, { 45, "매도량5"  },  
        {211, "매도건1"  }, {212, "매도건2"  },  {213, "매도건3"  },
        {214, "매도건4"  }, {215, "매도건5"  },  
            { 71, "매수가1"  }, { 72, "매수가2"  },  { 73, "매수가3"  },
        { 74, "매수가4"  }, { 75, "매수가5"  },  
        { 61, "매수량1"  }, { 62, "매수량2"  },  { 63, "매수량3"  },
        { 64, "매수량4"  }, { 65, "매수량5"  },  
        {221, "매수건1"  }, {222, "매수건2"  },  {223, "매수건3"  },
        {224, "매수건4"  }, {225, "매수건5"  },  
        {231, "초과량1"  }, {232, "초과량2"  },  {233, "초과량3"  },
        {234, "초과량4"  }, {235, "초과량5"  },  {248, "초과잔량" }, 
        {101, "매도총량" }, {103, "매도총비" },
        {106, "매수총량" }, {108, "매수총비" },
        {  0, ""         },}},
    {  0,  {{  0, ""         },}}
};

/* tickusfx : 해외지수,투자자,프로그램매매 Key define   */
struct  symrts sr_usinfo[] = {      /* 해외 지수    */
    { 'V', {{ 0, "타입"  }, { 34, "거래시간" }, { 23, "현재가"   }, { 24, "전일대비" }, 
        { 33, "등락률"   }, { 27, "거래량"   }, { 29, "시가"     }, 
        { 30, "고가"     }, { 31, "저가"     }, { 32, "체결량"   }, 
        {  0, ""         },
    }},
    /* END-OF-TABLE */
    {  0,  {{   0, ""      },}}
};
struct  symrts sr_whois[] = {       /* 투자자별 업종별 매매 */
    { 'M', {
        { 0, "타입"  },
        { 34, "처리시간" }, {333, "매도수량" }, {334, "매수수량" }, 
        {335, "전매수량" }, {336, "환매수량" }, {337, "직전매도량" }, 
        {338, "직전매수량" }, {339, "매도대금" }, {340, "매수대금" }, 
        {341, "전매대금" }, {342, "환매대금" },
        {343, "순매수수량" }, {344, "순매수금액" }, {345, "직전순매수금액" },
        {346, "직전순매수량" }, {347, "직전매도금액" }, {348, "직전매수금액" },
        {  0, ""         },
    }},
    /* END-OF-TABLE */
    {  0,  {{   0, ""      },}}
};
struct  symrts sr_program[] = {         /* 프로그램 매매 */
    { 'W', {
        { 0, "타입"  },
        { 34, "처리시간" }, 
        {303, "차도잔량" }, {304, "차수잔량" }, {305, "비도잔량" }, 
        {306, "비수잔량" }, {307, "차도수량" }, {308, "차수수량" },
        {309, "비도수량" }, {310, "비수수량" }, {311, "차도위량" }, 
        {312, "차도자량" }, {313, "차수위량" }, {314, "차수자량" },
        {315, "비도위량" }, {316, "비도자량" }, {317, "비수위량" }, 
        {318, "비수자수" }, {319, "차도위금" }, {320, "차도자금" },
        {321, "차수위금" }, {322, "차수자금" }, {323, "비도위금" }, 
        {324, "비도자금" }, {325, "비수위금" }, {326, "비수자금" },
        {327, "(전)순매수금액" }, {328, "(전)순매수수량" },
        {329, "(차)순매수금액" }, {330, "(차)순매수수량" },
        {331, "(비)순매수금액" }, {332, "(비)순매수수량" },

        /****** 2010.05.17 추가 심볼 - By Kmc **************/
        {401, "(전)매수금액"    },  {402, "(전)매수수량"    },
        {403, "(전)매도금액"    },  {404, "(전)매도수량"    },
        {405, "(차)매수금액"    },  {406, "(차)매수수량"    },
        {407, "(차)매도금액"    },  {408, "(차)매도수량"    },
        {409, "(비)매수금액"    },  {410, "(비)매수수량"    },
        {411, "(비)매도금액"    },  {412, "(비)매도수량"    },
        {413, "KP200지수"       },  {414, "KP200대비"       },
        {415, "KOSDAQ지수"      },  {416, "KOSDAQ대비"      },
        {417, "BASIS"           },  {418, "KP200거래량"     },
        {419, "KOSDAQ거래량"    },

        /*      2011.04.18 추가 심볼 - BY CHT               */
        {802, "차익매도비율"    },  {803, "차익매수비율"    },
        {805, "비차익매도비율"  },  {806, "비차익매수비율"  },

        {  0, ""         },
    }},
    /* END-OF-TABLE */
    {  0,  {{   0, ""      },}}
};

struct  symrts  sr_trader[] = {
    /* 거래원 */
    { 'Q', {{ 0, "타입"  }, {190, "회원사코드" }, {191, "회원사명" }, {192, "종목코드" },
        {193, "종목명"     }, {194, "시간"     },
        {195, "매수수량" }, {196, "매도수량"   }, {197, "순매수"   },
        {198, "누적매수수량" }, {199, "누적매도수량"   }, {200, "누적순매수"   },
        {201, "누적순매수대비"}, {202, "비중"},
        {  0, ""         },}},
    {  0,  {{  0, ""         },}}
};

/* tickpane : NEWS      */
struct  symrts sr_news[] = { 
    { 'T', {{ 0, "타입"  }, { 15,  "제목"  }, { 14, "RECN"  }, { 16, "KEYV" },
        { 301, "코드"  }, { 22, "종목명" },
        { 41,  "KEY1"  }, { 42, "KEY2"  },
        { 44,  "시간"  }, { 45, "분류"  }, { 46, "분류2" },
        { 47,  "XFLG"  }, { 48, "일자"  }, { 49, "종목"  }, }}, 
    {   0, {{   0,  ""         },}}
};
struct  symrts sr_updown[] = { 
    { 'N', {{ 0, "타입"  }, { 34,  "시간"   }, { 23,  "지수"   }, { 24,  "전일대비" },
            { 33,  "등락율" },}},
    {   0, {{   0,  ""      },}}
};
struct  symrts sr_screen[] = { 
    { 'j', {{ 0, "타입"  }, { 34,  "시간"   }, { 23,  "메시지"   },}},
    {   0, {{   0,  ""      },}}
};
struct  symrts sr_exchang[] = { 
    { 'x', {{ 0, "타입"  }, { 34,  "시간"   }, { 23,  "환율"   }, { 24,  "전일대비" },}},
    {   0, {{   0,  ""      },}}
};

/* 시세변동판 */
struct  symrts sr_board[] = { 
    { 'w', {{ 0, "타입"  }, { 21, "코드"  }, { 34,  "시간"   }, { 22, "종목명" },
        { 23, "현재가"  }, { 24, "전일대비"  }, { 33, "등락율"    },
        { 27, "거래량"  }, { 32, "체결량"    }, { 28, "거래대금"  },}},
    {   0, {{   0,  ""      },}}
};

/* 종목검색 데이터 */
struct  symrts  sr_search[] = {
    { 'v', {{ 0, "타입"  }, { 270, "종목검색데이터"  },}},
    {   0, {{   0,  ""      },}}
};

/* 채권 */
struct  symrts sr_bond[] = { 
    { 'z', {{ 0, "타입"  }, {302, "표준코드"},    { 34, "체결시간" }, { 24, "전일대비"  }, 
        { 23, "현재가"  }, { 32, "체결량"   }, { 27, "거래량"   },
        { 33, "등락률"  }, { 25, "매도호가"  }, { 26, "매수호가"  },
        { 29, "시가"  }, { 30, "고가"  }, { 31, "저가"  },
        { 111, "시가수익률"  }, { 112, "고가수익률"  }, { 113, "저가수익률"  },
        { 114, "체결수익률" }, { 28, "거래대금" }, {  0, ""         },}},
    { 'Z', {{ 0, "타입"  }, {302, "표준코드"},
        { 51, "매도가1"  }, { 52, "매도가2"  },  { 53, "매도가3"  },
        { 54, "매도가4"  }, { 55, "매도가5"  },  
        { 41, "매도량1"  }, { 42, "매도량2"  },  { 43, "매도량3"  },
        { 44, "매도량4"  }, { 45, "매도량5"  },  
        { 81, "매도수익률1"  }, { 82, "매도수익률2"  },  { 83, "매도수익률3"  },
        { 84, "매도수익률4"  }, { 85, "매도수익률5"  },  
        { 71, "매수가1"  }, { 72, "매수가2"  },  { 73, "매수가3"  },
        { 74, "매수가4"  }, { 75, "매수가5"  },  
        { 61, "매수량1"  }, { 62, "매수량2"  },  { 63, "매수량3"  },
        { 64, "매수량4"  }, { 65, "매수량5"  },  
        { 91, "매수수익률1"  }, { 92, "매수수익률2"  },  { 93, "매수수익률3"  },
        { 94, "매수수익률4"  }, { 95, "매수수익률5"  },  
        {101, "매도총량" }, {106, "매수총량" }, 
        {  0, ""         },}},
    {  0,  {{  0, ""         },}}
};

/* 장운영 정보 */
struct  symrts sr_jtime[] = {
    { 'S', {{ 0, "타입"  }, { 47,  "FLAG"   }, { 600, "장구분"  }, { 601, "KEY" }, { 23,  "메시지"   },}},
    {   0, {{   0,  ""      },}}
};

struct  symrts  sr_co_fu[] = {
    /* 상품선물체결 */
    { 'f', {{ 0, "타입"  }, { 34, "체결시간" }, { 23, "현재가"   }, { 24, "전일대비" },
        { 33, "등락율"   }, { 25, "매도호가" }, { 26, "매수호가" },
        { 32, "체결량"   }, { 27, "거래량"   }, { 28, "거래대금" },
        { 29, "시가"     }, { 30, "고가"     }, { 31, "저가"     },
        {201, "미결약정" }, {202, "이론가"   }, {203, "이론BASIS"},
        {204, "시장BASIS"}, {205, "괴리율"   }, {206, "미결대비" },
        {  2, "기초자산" }, { 19, "매수체결량"},{ 20, "매도체결량"},
        {  3, "기초대비" }, { 4, "기초등락"}, {271, "실시간상한가"}, {272, "실시간하한가"},
        {  0, ""         },}},
    /* 호가잔량 */
    { 'g', {{ 0, "타입"  }, { 40, "호가시간" },
        { 25, "매도호가" }, { 26, "매수호가" },
        { 51, "매도가1"  }, { 52, "매도가2"  },  { 53, "매도가3"  },
        { 54, "매도가4"  }, { 55, "매도가5"  },  
        { 41, "매도량1"  }, { 42, "매도량2"  },  { 43, "매도량3"  },
        { 44, "매도량4"  }, { 45, "매도량5"  },  
        {211, "매도건1"  }, {212, "매도건2"  },  {213, "매도건3"  },
        {214, "매도건4"  }, {215, "매도건5"  },  
        { 71, "매수가1"  }, { 72, "매수가2"  },  { 73, "매수가3"  },
        { 74, "매수가4"  }, { 75, "매수가5"  },  
        { 61, "매수량1"  }, { 62, "매수량2"  },  { 63, "매수량3"  },
        { 64, "매수량4"  }, { 65, "매수량5"  },  
        {221, "매수건1"  }, {222, "매수건2"  },  {223, "매수건3"  },
        {224, "매수건4"  }, {225, "매수건5"  },  
        {101, "매도총량" }, {103, "매도총건" },
        {106, "매수총량" }, {108, "매수총건" }, {120, "매도수량차"},
        
        { 56, "매도가6"  }, { 57, "매도가6"  },  { 58, "매도가8"  },
        { 59, "매도가9"  }, { 60, "매도가10"  },  
        { 46, "매도량6"  }, { 47, "매도량7"  },  { 48, "매도량8"  },
        { 49, "매도량9"  }, { 50, "매도량10"  },  
        {216, "매도건6"  }, {217, "매도건6"  },  {218, "매도건8"  },
        {219, "매도건9"  }, {220, "매도건10"  },  
        { 76, "매수가6"  }, { 77, "매수가7"  },  { 78, "매수가8"  },
        { 79, "매수가9"  }, { 80, "매수가10"  },  
        { 66, "매수량6"  }, { 67, "매수량7"  },  { 68, "매수량8"  },
        { 69, "매수량9"  }, { 70, "매수량10"  },  
        {226, "매수건6"  }, {227, "매수건7"  },  {228, "매수건8"  },
		{229, "매수건9"  }, {230, "매수건10"  },  
		{90, "장운용종료"},
		{115, "예상전일대비" }, {116, "예상등락율" },
		{111, "예상가격" }, /*  <= 예상가는 가장 마지막에 위치  */
        {  0, ""         },}},

    /* 예상체결 */
    { 't', {{ 0, "타입"  }, {110, "예상체결시간" },
        {111, "예상가격" }, {112, "예상수량" },
        {113, "예상현재대비" }, {114, "예상현재등락" },
        {115, "예상전일대비" }, {116, "예상전일대비" },
        {  0, ""         },}},
    /* 미결제       */
    { 'r', {{ 0, "타입"  }, {201, "미결약정" }, {206, "미결대비" },
        {  0, ""         },}},
	
	/* 장운영   */
	{ '3', {{ 0, "타입"  }, { 271, "실시간상한가" },
			   {272, "실시간하한가"}, {273, "가격제한단계"}, {274, "가격제한방향"},
			   {275, "가격제한시각"},
			   {  0, ""         },}},

	/*  20150625    */
	/* 상하한가 제한폭 확대 */
	{ '9', 
		{{ 0, "타입"  }, {381, "현재상한단계"}, 
			{382, "현재하한단계" }, {354, "현재상한가" }, {355, "현재하한가" },
			{  0, ""         },}},

	/* 상하한가 제한폭 예정 */
	{ '!', 
		{{ 0, "타입"  }, {273, "예정단계"}, {274, "예정방향" }, {275, "예정시각" },
			{  0, ""         },}},

    {  0,  {{  0, ""         },}}
};

struct  symrts  sr_co_op[] = {
    /* 상품옵션체결 */
    { 'm', {{ 0, "타입"  }, { 34, "체결시간" }, { 23, "현재가"   }, { 24, "전일대비" },
        { 33, "등락율"   }, { 25, "매도호가" }, { 26, "매수호가" },
        { 32, "체결량"   }, { 27, "거래량"   }, { 28, "거래대금" },
        { 29, "시가"     }, { 30, "고가"     }, { 31, "저가"     },
        {201, "미결약정" }, {206, "미결대비" }, 
        {  0, ""         },}},
    /* 호가잔량 */
    { 'n', {{ 0, "타입"  }, { 40, "호가시간" },
        { 25, "매도호가" }, { 26, "매수호가" },
        { 51, "매도가1"  }, { 52, "매도가2"  },  { 53, "매도가3"  },
        { 54, "매도가4"  }, { 55, "매도가5"  },  
        { 41, "매도량1"  }, { 42, "매도량2"  },  { 43, "매도량3"  },
        { 44, "매도량4"  }, { 45, "매도량5"  },  
        {211, "매도건1"  }, {212, "매도건2"  },  {213, "매도건3"  },
        {214, "매도건4"  }, {215, "매도건5"  },  
            { 71, "매수가1"  }, { 72, "매수가2"  },  { 73, "매수가3"  },
        { 74, "매수가4"  }, { 75, "매수가5"  },  
        { 61, "매수량1"  }, { 62, "매수량2"  },  { 63, "매수량3"  },
        { 64, "매수량4"  }, { 65, "매수량5"  },  
        {221, "매수건1"  }, {222, "매수건2"  },  {223, "매수건3"  },
        {224, "매수건4"  }, {225, "매수건5"  },  
        {101, "매도총량" }, {103, "매도총비" },
        {106, "매수총량" }, {108, "매수총건" }, {120, "매도수량차"},
        {  0, ""         },}},
    /* 예상체결 */
    /*{ 'q', {{ 0, "타입"  }, {110, "예상체결시간" },
        {111, "예상가격" }, {112, "예상수량" },
        {113, "예상현재대비" }, {114, "예상현재등락" },
        {115, "예상전일대비" }, {116, "예상전일대비" },
        {  0, ""         },}},*/
        
        
    {  0,  {{  0, ""         },}}
};
