/*************************************************************************************/
/*  1. 프로그램ID : EU_p0624                                                         */
/*  2. 프로그램명 : 조건검색_패턴검색                                                */
/*  3. 서비스명   : EU_p0624                                                         */
/*  4. 사용테이블 :                                                                  */
/*  5. 작성자     : drfn                                                             */
/*  6. 입력항목   :                                                                  */
/*  7. 출력항목   :                                                                  */
/*************************************************************************************/
#ifndef __EU_TRAN_EU_p0624_H__
#define __EU_TRAN_EU_p0624_H__

/*************************************************************************************/
/* include file                                                                      */
/*************************************************************************************/

/*************************************************************************************/
/* define constant                                                                   */
/*************************************************************************************/
#define EU_TRAN0624                       "EU_p0624"
#define LLONG                         long long


/*************************************************************************************/
/* Input structure                                                                   */
/*************************************************************************************/

/* InRec1:                                                                           */
typedef struct
{
    char    nTrIndex[4];                          /* 콜구분(4)                       */
    char    iS_Time[4];                           /* 대상시간(4)                     */
    char    iTarget[4];                           /* 대상데이터=>4고정(4)            */
    char    iMoveAvg[4];                          /* 이평기간=>1고정(4)              */
    char    iS_Pos[4];                            /* 검색시작위치(4)                 */
    char    iS_Range[4];                          /* 검색범위(4)                     */
    char    iSimilar[4];                          /* 유사도(4)                       */
    char    sBoxFlag[1];                          /* 횡보체크여부(1)                 */
    char    FieldEditerCnt[4];                    /* 필드편집개수(4)                 */
    char    FieldList[80];                        /* 필드편집번호리스트(80)          */
    char    sTargetBit[4000];               		/* 검색대상종목(4000)              */	//3000 -> 4000
    char    iAccuVal[4];                          /* 최근가중치적용여부(4)           */
    char    iDraw_Cnt[4];                         /* 그리기기간범위(20~120)(4)       */
    char    iErrRate[4];                          /* 오차율(4)                       */
    char    iGapRate[4];                          /* 필터범위(4)                     */
    char    iDraw_Value[480];                     /* 그리기좌표값(0~100)(480)        */
}EU_p0624_InRec1;


/*************************************************************************************/
/* Output structure                                                                  */
/*************************************************************************************/

/* OutRec1:                                                                          */
typedef struct
{
    char    nTrIndex[4];                          /* 콜구분(4)                       */
    char    lTotalJongCnt[4];                     /* 검색종목수(4)                   */
    char    lOutFieldCnt[4];                      /* OutFieldCount(4)                */
    char    lOutListPacketSize[4];                /* 결과List사이즈(4)               */
    char    lFindTime[6];                         /* 검색시간(6)                     */
}EU_p0624_OutRec1;

/* OutRec2:                                                                          */
char EU_p0624_OutRec2_count[4];
typedef struct
{
    char    sJmcode[7];                           /* 종목코드(7)                     */
    char    sHname[20];                           /* 종목명(20)                      */
    char    sSign[1];                             /* 등락부호(1)                     */
    char    sMarket[1];                           /* 시장구분(1)                     */
    char    iTarget[4];                           /* 대상타겟(4)                     */
    char    sDateTime_Start[14];                  /* 검색마지막봉(14)                */
    char    sDateTime_End[14];                    /* 검색시작봉(14)                  */
    char    dFieldData[320];                      /* 유동필드결과값(320)             */
}EU_p0624_OutRec2;

/*************************************************************************************/

#endif

